Revit 2027 API
BuiltInFailures.CurveFailures.CantKeepJoinTangent Property
 Can't keep curve join tangent.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CantKeepJoinTangent { get; }
Public Shared ReadOnly Property CantKeepJoinTangent As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CantKeepJoinTangent {
	FailureDefinitionId^ get ();
}
static member CantKeepJoinTangent : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurveFailures Class
Autodesk.Revit.DB Namespace